GopalSaraf/Practicals/PSDL/include/proc/pic16f887.inc
// Register: CM2CON0
#define CM2CON0 CM2CON0
CM2CON0                                  equ 0108h
// bitfield definitions
CM2CON0_C2CH_POSN                        equ 0000h
CM2CON0_C2CH_POSITION                    equ 0000h
CM2CON0_C2CH_SIZE                        equ 0002h
CM2CON0_C2CH_LENGTH                      equ 0002h
CM2CON0_C2CH_MASK                        equ 0003h
CM2CON0_C2R_POSN                         equ 0002h
CM2CON0_C2R_POSITION                     equ 0002h
CM2CON0_C2R_SIZE                         equ 0001h
CM2CON0_C2R_LENGTH                       equ 0001h
CM2CON0_C2R_MASK                         equ 0004h
CM2CON0_C2POL_POSN                       equ 0004h
CM2CON0_C2POL_POSITION                   equ 0004h
CM2CON0_C2POL_SIZE                       equ 0001h
CM2CON0_C2POL_LENGTH                     equ 0001h
CM2CON0_C2POL_MASK                       equ 0010h
CM2CON0_C2OE_POSN                        equ 0005h
CM2CON0_C2OE_POSITION                    equ 0005h
CM2CON0_C2OE_SIZE                        equ 0001h
CM2CON0_C2OE_LENGTH                      equ 0001h
CM2CON0_C2OE_MASK                        equ 0020h
CM2CON0_C2OUT_POSN                       equ 0006h
CM2CON0_C2OUT_POSITION                   equ 0006h
CM2CON0_C2OUT_SIZE                       equ 0001h
CM2CON0_C2OUT_LENGTH                     equ 0001h
CM2CON0_C2OUT_MASK                       equ 0040h
CM2CON0_C2ON_POSN                        equ 0007h
CM2CON0_C2ON_POSITION                    equ 0007h
CM2CON0_C2ON_SIZE                        equ 0001h
CM2CON0_C2ON_LENGTH                      equ 0001h
CM2CON0_C2ON_MASK                        equ 0080h
CM2CON0_C2CH0_POSN                       equ 0000h
CM2CON0_C2CH0_POSITION                   equ 0000h
CM2CON0_C2CH0_SIZE                       equ 0001h
CM2CON0_C2CH0_LENGTH                     equ 0001h
CM2CON0_C2CH0_MASK                       equ 0001h
CM2CON0_C2CH1_POSN                       equ 0001h
CM2CON0_C2CH1_POSITION                   equ 0001h
CM2CON0_C2CH1_SIZE                       equ 0001h
CM2CON0_C2CH1_LENGTH                     equ 0001h
CM2CON0_C2CH1_MASK                       equ 0002h

// Register: CM2CON1
#define CM2CON1 CM2CON1
CM2CON1                                  equ 0109h
// bitfield definitions
CM2CON1_C2SYNC_POSN                      equ 0000h
CM2CON1_C2SYNC_POSITION                  equ 0000h
CM2CON1_C2SYNC_SIZE                      equ 0001h
CM2CON1_C2SYNC_LENGTH                    equ 0001h
CM2CON1_C2SYNC_MASK                      equ 0001h
CM2CON1_T1GSS_POSN                       equ 0001h
CM2CON1_T1GSS_POSITION                   equ 0001h
CM2CON1_T1GSS_SIZE                       equ 0001h
CM2CON1_T1GSS_LENGTH                     equ 0001h
CM2CON1_T1GSS_MASK                       equ 0002h
CM2CON1_C2RSEL_POSN                      equ 0004h
CM2CON1_C2RSEL_POSITION                  equ 0004h
CM2CON1_C2RSEL_SIZE                      equ 0001h
CM2CON1_C2RSEL_LENGTH                    equ 0001h
CM2CON1_C2RSEL_MASK                      equ 0010h
CM2CON1_C1RSEL_POSN                      equ 0005h
CM2CON1_C1RSEL_POSITION                  equ 0005h
CM2CON1_C1RSEL_SIZE                      equ 0001h
CM2CON1_C1RSEL_LENGTH                    equ 0001h
CM2CON1_C1RSEL_MASK                      equ 0020h
CM2CON1_MC2OUT_POSN                      equ 0006h
CM2CON1_MC2OUT_POSITION                  equ 0006h
CM2CON1_MC2OUT_SIZE                      equ 0001h
CM2CON1_MC2OUT_LENGTH                    equ 0001h
CM2CON1_MC2OUT_MASK                      equ 0040h
CM2CON1_MC1OUT_POSN                      equ 0007h
CM2CON1_MC1OUT_POSITION                  equ 0007h
CM2CON1_MC1OUT_SIZE                      equ 0001h
CM2CON1_MC1OUT_LENGTH                    equ 0001h
CM2CON1_MC1OUT_MASK                      equ 0080h

// Register: EEDATA
#define EEDATA EEDATA
EEDATA                                   equ 010Ch

// Register: EEADR
#define EEADR EEADR
EEADR                                    equ 010Dh

// Register: EEDATH
#define EEDATH EEDATH
EEDATH                                   equ 010Eh

// Register: EEADRH
#define EEADRH EEADRH
EEADRH                                   equ 010Fh

// Register: SRCON
#define SRCON SRCON
SRCON                                    equ 0185h
// bitfield definitions
SRCON_FVREN_POSN                         equ 0000h
SRCON_FVREN_POSITION                     equ 0000h
SRCON_FVREN_SIZE                         equ 0001h
SRCON_FVREN_LENGTH                       equ 0001h
SRCON_FVREN_MASK                         equ 0001h
SRCON_PULSR_POSN                         equ 0002h
SRCON_PULSR_POSITION                     equ 0002h
SRCON_PULSR_SIZE                         equ 0001h
SRCON_PULSR_LENGTH                       equ 0001h
SRCON_PULSR_MASK                         equ 0004h
SRCON_PULSS_POSN                         equ 0003h
SRCON_PULSS_POSITION                     equ 0003h
SRCON_PULSS_SIZE                         equ 0001h
SRCON_PULSS_LENGTH                       equ 0001h
SRCON_PULSS_MASK                         equ 0008h
SRCON_C2REN_POSN                         equ 0004h
SRCON_C2REN_POSITION                     equ 0004h
SRCON_C2REN_SIZE                         equ 0001h
SRCON_C2REN_LENGTH                       equ 0001h
SRCON_C2REN_MASK                         equ 0010h
SRCON_C1SEN_POSN                         equ 0005h
SRCON_C1SEN_POSITION                     equ 0005h
SRCON_C1SEN_SIZE                         equ 0001h
SRCON_C1SEN_LENGTH                       equ 0001h
SRCON_C1SEN_MASK                         equ 0020h
SRCON_SR0_POSN                           equ 0006h
SRCON_SR0_POSITION                       equ 0006h
SRCON_SR0_SIZE                           equ 0001h
SRCON_SR0_LENGTH                         equ 0001h
SRCON_SR0_MASK                           equ 0040h
SRCON_SR1_POSN                           equ 0007h
SRCON_SR1_POSITION                       equ 0007h
SRCON_SR1_SIZE                           equ 0001h
SRCON_SR1_LENGTH                         equ 0001h
SRCON_SR1_MASK                           equ 0080h

